{
  "semesters": [
    {
      "title": "Fall",
      "sections": [
        {
          "title": "Websites & Electronics",
          "classes": [
            {
              "title": "Basics of Websites",
              "subTitle": "Learn how to create and host a website",
              "description": "You'll receive a <a href=\"https://www.raspberrypi.com/products/raspberry-pi-pico/\">Raspberry Pi Pico W</a> minicomputer. We'll look at a tutorial showing you how to host a website on it called <a href=\"https://projects.raspberrypi.org/en/projects/get-started-pico-w/\">Getting started with your Raspberry Pi Pico W</a>. If you have trouble with the tutorial and just want to download the finished program, you can do so by clicking <a href=\"files/pico_website_complete_code.txt\" download>here</a>.<br><br>We'll look at a <a href=\"https://youtu.be/h8K49dD52WA?t=18\">brief history of the internet</a>.<br><br>We'll also look at our browser's Developer Tools (Ctrl+Shift+I). In Dev Tools, go to the Console tab and then enter <code>document.designMode = 'on'</code>, hit enter, and you'll be able to modify any text on the website.<br><br>Finally, we'll <a href=\"https://code.visualstudio.com/\">download Visual Studio Code</a> and then open it up and click the 'Extensions' icon on the far left (it looks like four squares) and then search for and install the 'Live Server' extension created by Ritwick Dey. Then we will click the 'Explore' icon at the top left, click 'Open Folder', create a new folder on your computer and select it, and then create a new file in that folder that ends with '.html' such as 'website.html'. We'll open that file in Visual Studio Code and enter an exclamation point (!) and then hit the 'tab' key and it will generate a boilerplate HTML document for us. We'll then put some text between the <code>&lt;body&gt;</code> and <code>&lt;/body&gt;</code> tags to have something to see on our website. We can then view the website by clicking the 'Go Live' button at the very bottom or very top of Visual Studio code and a browser window will open and display your website. Once you make any changes to your '.html' file and save it, your changes should appear immediately in the browser window that opened automatically.",
              "date": "2024-08-13",
              "tips": [
                "A few more great Raspberry Pi Pico W tutorials on building web servers are <a href=\"https://core-electronics.com.au/guides/raspberry-pi-pico-w-create-a-simple-http-server/\">here</a>, <a href=\"https://www.youtube.com/watch?v=0sPPxIq4hg8\">here</a>, and <a href=\"https://www.doctormonk.com/2022/09/a-better-web-server-for-raspberry-pi.html\">here</a> (which uses the Microdot library to make things a bit easier).",
                "For more in-depth lessons on the Raspberry Pi Pico W, check out Paul McWhorter on YouTube who has an entire playlist dedicated to <a href=\"https://www.youtube.com/playlist?list=PLGs0VKk2DiYz8js1SJog21cDhkBqyAhC5\">Raspberry Pi Pico W Lessons for Absolute Beginners</a> using this <a href=\"https://www.amazon.com/SunFounder-Raspberry-Kit-MicroPython-Compatible/dp/B0BDFVL6FX\">Starter Kit</a> from Amazon.",
                "You can also edit text on a website (and much more) by installing the free <a href=\"https://chromewebstore.google.com/detail/visbug/cdockenadnadldjbbgcallicgledbeoc\">VisBug</a> extension for your browser.",
                "<a href=\"https://developer.mozilla.org/en-US/docs/Learn\">Learn Web Development</a> is a free and very popular tutorial for learning about web development.",
                "<a href=\"https://www.amazon.com/gp/product/1484287509\">Programming for Absolute Beginners</a> is a great book written by a homeschool dad for anyone interested in learning web development.",
                "<a href=\"/exercises/html.html\">HTML Printout</a>"
              ]
            },
            {
              "title": "Basics of Electronics",
              "subTitle": "From Atoms to Chips",
              "description": "Electronics starts with electrons. To understand electrons, we will <a href=\"https://phet.colorado.edu/sims/html/build-an-atom/latest/build-an-atom_all.html\">build an atom</a>, look at the <a href=\"https://ptable.com/\">periodic table</a>, see <a href=\"https://www.youtube.com/watch?v=pGWSX6pStd0&ab_channel=ScienceVideos\">actual atoms under an electron microscope</a>, learn about <a href=\"https://phet.colorado.edu/sims/html/charges-and-fields/latest/charges-and-fields_all.html\">electron charges and fields</a>, see how <a href=\"https://simbucket.com/drudemodel/\">electrons move inside metal</a>, build some <a href=\"https://phet.colorado.edu/sims/html/circuit-construction-kit-dc-virtual-lab/latest/circuit-construction-kit-dc-virtual-lab_all.html\">basic circuits</a>, and possibly dive into a <a href=\"https://www.withdiode.com\">3D circuit simulator</a>.<br><br> We may also look at some CPU simulations to get a feel for how they work. These include the <a href=\"http://visual6502.org/JSSim/index.html\">6502 Simulation</a> (the CPU used in the original Nintendo), and the <a href=\"http://visual6502.org/sim/varm/armgl.html\">Arm1 CPU Simulation</a> (the ARM is a type of CPU used in mobile devices), and the <a href=\"/sim/ScottCPU.html\">Scott CPU Simulation</a> (from a great book called <a href=\"https://www.amazon.com/But-How-Know-Principles-Computers-ebook/dp/B00F25LEVC\">But How Do It Know</a> that teaches the basic principles of computers).",
              "date": "2024-08-20",
              "tips": [
                "<a href=\"https://www.youtube.com/watch?v=yf-lNTN_Ufc\">How Small Are Atoms?</a>",
                "<a href=\"https://youtu.be/W2Xb2GFK2yc?t=9\">What atoms & electrons really look like</a>",
                "<a href=\"https://youtube.com/watch?v=W7WzxpI3eWE\">How Brownian Motion Helped Prove the Existence of Atoms</a>",
                "<a href=\"https://www.falstad.com/circuit\">An In-Depth 2D Circuit Simulator</a>",
                "Here is a video that uses 3D graphics to explain <a href=\"https://www.youtube.com/watch?v=dX9CGRZwD-w\">how a CPU is made</a> and another explaining <a href=\"https://www.youtube.com/watch?v=cNN_tTXABUA\">how a CPU works</a>.",
                "<a href=\"https://www.youtube.com/watch?v=NvzSLByrw4Q&ab_channel=physicslectures\">Exploring the Quantum World - The Double Slit Experiment</a>"
              ]
            },
            {
              "title": "Review, Competitions & Group Activities",
              "subTitle": "We will review what we've learned, compete, and work in groups",
              "description": "We will review what we have learned so far in this module, you'll get a chance to show off any technology projects you've been working on at home, we will have some class competitions covering what we have learned, and then we'll split off into groups to work on some group activities.",
              "date": "2024-08-27",
              "tips": []
            }
          ]
        },
        {
          "title": "Hardware & Networks",
          "classes": [
            {
              "title": "Basics of Computer Hardware",
              "subTitle": "Exploring a Computer",
              "description": "We'll start with a quick look at the main components <a href=\"https://youtube.com/watch?v=HB4I2CgkcCo\">inside a computer</a> including the motherboard, CPU, RAM, and hard drive.<br><br>We'll also look at the first part of a video showing a <a href=\"https://youtube.com/watch?v=d86ws7mQYIg\">3D walkthrough of every component in a computer</a>.<br><br>We'll also see how a <a href=\"https://www.youtube.com/watch?v=SrAMBi_8tIk\">graphics card</a>, <a href=\"https://www.youtube.com/watch?v=7J7X7aZvMXQ\">computer memory</a> (RAM), <a href=\"https://www.youtube.com/watch?v=h-NM1xSSzHQ\">keyboards</a>, <a href=\"https://youtube.com/watch?v=SAaESb4wTCM\">mice</a>, <a href=\"https://www.youtube.com/watch?v=wtdnatmVdIg\">hard drives</a>, and <a href=\"https://www.youtube.com/watch?v=5Mh3o886qpg\">solid state hard drives</a> work.<br><br>We'll also look at <a href=\"https://youtube.com/watch?v=Jz8Gs4UHTO8\">a computer vs a virtual machine vs a container</a> to understand how modern computing is done.<br><br>We'll then <a href=\"https://www.virtualbox.org/wiki/Downloads\">download VirtualBox</a>, <a href=\"https://ubuntu.com/download/desktop\">download an Ubuntu ISO file</a>, and then create a virtual machine in VirtualBox using the Ubuntu ISO. We'll see how snapshots work in a virtual machine.<br><br>We'll then <a href=\"https://docs.docker.com/desktop/install/windows-install/\">download Docker</a>, <a href=\"files/docker-compose.yml\" download>download a sample docker-compose.yml file</a> for running a Wordpress blog and then run <code>docker-compose up -d</code> and visit <code>http://localhost</code> in our browser to see our Wordpress admin site that is running in Docker. We'll also <a href=\"https://dev.mysql.com/downloads/workbench/\">download MySQL Workbench</a> to see the data in the database that was created by Docker.",
              "date": "2024-09-03",
              "tips": [
                "\"<a href=\"https://en.wikipedia.org/wiki/The_Mother_of_All_Demos\">The Mother of All Demos</a>\" (<a href=\"https://www.youtube.com/watch?v=2nm47PFALc8\">full video</a>) (<a href=\"https://www.youtube.com/watch?v=B6rKUf9DWRI\">summary video</a>) was a landmark computer demonstration in 1968 that showed off, for the first time, many of the technologies we use today including the computer mouse, a word processor, hyperlinked text (like on a website) and video conferencing.",
                "Another more detailed video about <a href=\"https://www.youtube.com/watch?v=Kgcfj_KV-mo\">how graphics cards work</a>",
                "A 3D animation showing <a href=\"https://www.youtube.com/watch?v=dX9CGRZwD-w\">how CPUs are made<a/>",
                "A nice video explaining <a href=\"https://www.youtube.com/watch?v=Kv1Hiv3ox8I\">how JPEG images are compressed</a>",
                "Another good video about <a href=\"https://www.youtube.com/watch?v=eyNBf1sqdBQ\">virtual machines vs containers</a>.",
                "A nice playlist where Ben Eater <a href=\"https://www.youtube.com/playlist?app=desktop&list=PLowKtXNTBypGqImE405J2565dvjafglHU\">builds an 8-bit computer from scratch</a>.",
                "If you really want to know how a computer works from the ground up, one of the classic books for students is called <a href=\"https://www.nand2tetris.org\">Nand2Tetris</a> (<a href=\"https://www.amazon.com/Elements-Computing-Systems-second-Principles/dp/0262539802\">book</a>, <a href=\"https://www.coursera.org/learn/build-a-computer\">free Coursera course part 1</a>, <a href=\"https://www.coursera.org/learn/nand2tetris2\">part 2</a>).",
                "<a href=\"https://www.youtube.com/watch?v=_eo8l7HP-9U\">How to Build a 4-Bit Computer on Breadboards Using Individual Transistors</a>"
              ]
            },
            {
              "title": "Basics of Networks & SDR",
              "subTitle": "Introduction to computer communication",
              "description": "We'll look at a <a href=\"https://youtube.com/watch?v=35KXThuTeVs\">quick explanation of how the internet works</a> followed by a look at the <a href=\"https://youtu.be/DsEqg6zBHZE?t=157\">basics of a software called Wireshark</a>. We'll use <a href=\"https://www.wireshark.org/\">Wireshark</a> to inspect some local network traffic, including from a <a href=\"https://formsmarts.com/html-form-example\">secure form</a> and from an <a href=\"http://cgi-lib.berkeley.edu/ex/simple-form.html\">insecure form</a>, and we'll use <a href=\"https://www.telerik.com/download/fiddler\">Fiddler</a> to get a higher-level view of that same network traffic. We'll also look at that same network traffic using our browser's Developer Tools (Ctrl/Cmd + Shift + I).<br><br>We will also use this cheap <a href=\"https://www.amazon.com/dp/B0CD7558GT\">USB SDR Kit</a> from the creators of the <a href=\"https://www.rtl-sdr.com/\">RTL-SDR.com</a> blog to find nearby wireless signals. We'll use the <a href=\"https://airspy.com/download/ \">SDR Sharp</a> software to listen to the signals coming from the USB SDR kit. We'll also use <a href=\"http://websdr.org/\">WebSDR</a> to use other peoples SDRs from around the world (see a map of these WebSDRs <a href=\"https://rx.skywavelinux.com/\">here</a>).",
              "date": "2024-09-10",
              "tips": [
                "<a href=\"https://cdn.comparitech.com/wp-content/uploads/2019/06/Wireshark-Cheat-Sheet-1.jpg\">Wireshark commands cheat sheet</a>",
                "<a href=\"https://www.youtube.com/playlist?list=PLowKtXNTBypH19whXTVoG3oKSuOcw_XeW\">Ben Eater's Full Networking Tutorial Playlist</a>",
                "<a href=\"https://blinry.org/50-things-with-sdr/\">50 Things you can do with a Software Defined Radio</a>",
                "<a href=\"https://www.radioreference.com\">Radio Reference</a> is a website with a huge database of frequencies you can listen to with an SDR.",
                "<a href=\"https://www.broadcastify.com/listen/ctid/2522\">Broadcastify.com</a> allows you to listen to police and fire radio online.",
                "<a href=\"https://www.youtube.com/watch?v=1I1vxu5qIUM\">How Bluetooth Works</a>",
                "<a href=\"https://www.youtube.com/watch?v=whEqaxlCVSs\">How Electromagnetic Waves Carry Messages</a>",
                "<a href=\"https://www.youtube.com/watch?v=0faCad2kKeg\">How Cell Service Actually Works</a>"
              ]
            },
            {
              "title": "Review, Competitions & Group Activities",
              "subTitle": "We will review what we've learned, compete, and work in groups",
              "description": "We will review what we have learned so far in this module, you'll get a chance to show off any technology projects you've been working on at home, we will have some class competitions covering what we have learned, and then we'll split off into groups to work on some group activities.",
              "date": "2024-09-17",
              "tips": []
            }
          ]
        },
        {
          "title": "Coding",
          "classes": [
            {
              "title": "Basics of Coding",
              "subTitle": "Learning how programming works",
              "description": "All programming, including web programming, uses basic text files to store those programs. We'll take a look at this <a href=\"https://hexed.it\">online hex editor</a> that lets you see the raw bits, the 1s and 0s, behind the text.<br><br>We'll look at videos about <a href=\"https://www.youtube.com/watch?v=zDNaUi2cjv4\">how binary works</a>, <a href=\"https://www.youtube.com/watch?v=zcsmHkKJgbE\">how transistors and logic gates work</a>, and <a href=\"https://www.youtube.com/watch?v=4gwYkEK0gOk\">how assembly language works</a>.<br><br>We'll also use a program called <a href=\"https://x64dbg.com/\">x64dbg</a> that lets us see, on a Windows computer, exactly what binary instructions the CPU is running when it is running a program.<br><br>We'll then look at <a href=\"https://www.youtube.com/watch?v=yOyaJXpAYZQ\">this excellent video</a> by Ben Eater that walks us through how a high level program works and then how it gets converted into binary to run on a CPU. We may also look at <a href=\"https://www.youtube.com/watch?v=YZV8Zv_YW7I\">the history of programming languages in 5 minutes</a> to understand where all these programming languages came from.<br><br>A high level language like C or Python cannot run on a computer directly. First the text files used to store that program must be scanned, parsed and eventually turned into binary instructions the computer's CPU can understand. We'll look at that process using an online tool called <a href=\"https://astexplorer.net/\">AST explorer</a> to see how those high level languages are parsed. We'll also look at tools like <a href=\"https://godbolt.org/\">compiler explorer</a> and <a href=\"https://www.linqpad.net/Download.aspx\">LINQPad</a> that show you what CPU instructions are created after a program written in a high level language like C or Python is parsed and complied into binary to be read by the computer.",
              "date": "2024-09-24",
              "tips": [
                "<a href=\"https://www.youtube.com/watch?v=CxGSnA-RTsA\">Computer Science Explained in 17 Minutes</a>",
                "Two of the most popular websites for learning coding online for free are <a href=\"https://www.codecademy.com/\">Codecademy</a> and <a href=\"https://www.freecodecamp.org/\">Free Code Camp</a>.",
                "Three of the best books for understanding how coding really works are <a href=\"https://www.amazon.com/But-How-Know-Principles-Computers-ebook/dp/B00F25LEVC\">But How Do It Know</a>, <a href=\"https://www.amazon.com/Computer-Systems-Programmers-Perspective-3/dp/9332573905\">Computer Systems: A Programmer's Perspective</a>, and <a href=\"https://www.amazon.com/Programming-Language-2nd-Brian-Kernighan/dp/0131103628\">The C Programming Language</a>",
                "If you really want to know how programming languages work, you can build one by reading <a href=\"https://craftinginterpreters.com/\">Crafting Interpreters</a> for free. It is one of the best resources available online for learning about programming.",
                "The <a href=\"https://www.iamtk.co/series/building-an-interpreter\">Building an Interpreter Series of Blog Posts</a> is another good resource for understanding how programming languages are created.",
                "JSON is one of the most common formats used in text files to send data to websites and mobile apps. <a href=\"https://ogzhanolguncu.com/blog/write-your-own-json-parser/\">Here</a> is a great blog post showing how to write a program to convert that JSON into something a program can understand.",
                "<a href=\"https://deeps.dev/posts/typescript-compiler-architecture-high-level-overview/\">Here</a> is a link to the raw source code for the TypeScript parser, one of the most popular languages used on the internet today. The scanner is what splits up the raw TypeScript source code text files into 'tokens' which are then fed to the parser so the computer can understand what those tokens mean.",
                "The Windows standard calculator when used in programmer mode lets you do calculations with binary and hexadecimal numbers.",
                "Here is <a href=\"https://github.com/InOneLesson/VideoScripts\">a series of lessons</a> that explain coding from the bits on up.",
                "To see how an operating system interacts with a running application on Windows, see <a href=\"https://www.youtube.com/watch?v=WL8rk7pNGo0\">this short video</a> showing the events that the operating system sends to an application window. The events are generated by the user when they click a mouse or type on the keyboard. Those events are received by the operating system and then sent to the application code based on which window is active on the screen. In this case the operating system sends the mouse move and mouse click events to that Windows Explorer application. Since the user clicked the mouse when it was hovering over the down arrow at the bottom of the scroll bar, the Windows Explorer application knows to scroll down when it receives that event."
              ]
            },
            {
              "title": "Basics of Bio Encoding",
              "subTitle": "Exploring God's Creativity in Life",
              "description": "We will look at <a href=\"https://youtube.com/watch?v=9kOGOY7vthk\">the remarkable world of DNA & molecular machines</a> with <a href=\"https://youtu.be/WFCvkkDSfIU?t=174\">animations of unseen biology</a>, <a href=\"https://www.youtube.com/watch?v=MNR48hUd-Hw\">a discussion about molecular machines</a>, a look at the <a href=\"https://www.youtube.com/watch?v=HUSDvSknIgI\">immune system</a>, and we'll have a look at the molecule inside all life on earth that powers muscles and nerves called <a href=\"https://youtu.be/qbyzEiBvbXw?t=932\">ATP</a>.<br><br>We will also look at an organization called <a href=\"https://www.discovery.org/id/\">the Discovery Center</a> based in Seattle that does some great research understanding biology from an 'Intelligent Design' perspective, meaning life was designed by a creator (God) and did not evolve from nothing. They have a great podcast called <a href=\"https://idthefuture.com/\">ID the Future</a> and a great blog called (ironically) <a href=\"https://evolutionnews.org\"/>Evolution News</a>.",
              "date": "2024-10-01",
              "tips": [
                "<a href=\"https://www.youtube.com/watch?v=lv89fSt5jBY\">Your Unstoppable Copy Machine | DNA Replication</a>",
                "<a href=\"https://www.youtube.com/watch?v=7Hk9jct2ozY\">Montage of DNA Animations</a>",
                "<a href=\"https://www.youtube.com/watch?v=kXpzp4RDGJI&ab_channel=HarvardOnline\">ATP / Electron Transport Chain (Harvard)</a>",
                "<a href=\"https://www.youtube.com/watch?v=N97cgUqV0Cg\">Actual Footage of Cell Division (Kidney Cells)</a>"
              ]
            },
            {
              "title": "Review, Competitions & Group Activities",
              "subTitle": "We will review what we've learned, compete, and work in groups",
              "description": "We will review what we have learned so far in this module, you'll get a chance to show off any technology projects you've been working on at home, we will have some class competitions covering what we have learned, and then we'll split off into groups to work on some group activities.",
              "date": "2024-10-15",
              "tips": []
            }
          ]
        },
        {
          "title": "Data & Cybersecurity",
          "classes": [
            {
              "title": "Basics of Data",
              "subTitle": "From Databases to Data Centers",
              "description": "We will use the <a href=\"https://sqlzoo.net\">SQL Zoo</a> tutorials to get hands-on practice with databases. We will look at the <a href=\"https://onecompiler.com/mysql\">MySQL Online Compiler</a> so we can write our own database online.<br><br>We will also <a href=\"https://www.youtube.com/watch?v=Amow8BJm5Go\">learn about data centers</a>, also known as the cloud, and we'll see <a href=\"https://github.com/WebCodingAndMore/Website\">how this website is hosted in the cloud</a>. ",
              "date": "2024-10-22",
              "tips": [
                "Tony Saro builds his own database from scratch in this <a href=\"https://www.youtube.com/watch?v=5Pc18ge9ohI\">video</a>."
              ]
            },
            {
              "title": "Basics of Cybersecurity",
              "subTitle": "How Hackers Think and How to Stop Them",
              "description": "We can use <a href=\"https://cyberchef.org/\">CyberChef</a> along with some <a href=\"https://github.com/mattnotmax/cyberchef-recipes\">example CyberChef recipes</a> to see how viruses and malware are sometimes hidden from virus scanners.",
              "date": "2024-10-29",
              "tips": [
                "Here is <a href=\"https://www.youtube.com/watch?v=UjjyIeoWY0I\">an in-depth tutorial on using CyberChef</a>."
              ]
            },
            {
              "title": "Review, Competitions & Group Activities",
              "subTitle": "We will review what we've learned, compete, and work in groups",
              "description": "We will review what we have learned so far in this module, you'll get a chance to show off any technology projects you've been working on at home, we will have some class competitions covering what we have learned, and then we'll split off into groups to work on some group activities.",
              "date": "2024-11-05",
              "tips": []
            }
          ]
        },
        {
          "title": "Game & App Dev",
          "classes": [
            {
              "title": "Basics of Game Development",
              "subTitle": "Basic to Advanced",
              "description": "We'll start by looking at a video showing the experience one person had spending <a href=\"https://www.youtube.com/watch?v=x5wndRdBowo\">3 months learning game development</a>. We'll also learn about <a href=\"https://www.youtube.com/watch?v=iqlH4okiQqg\">Unity in 100 seconds</a>.Next we'll learn <a href=\"https://www.youtube.com/watch?v=PcEbSoSGioY\">how to make a Roblox game</a>.<br><br>We'll then learn the basics of game design using these Scratch <a href=\"https://scratch.mit.edu/projects/editor/?tutorial=getStarted\">tutorials</a> (click 'Tutorials' at the top for additional tutorials). We'll also build some games using <a href=\"https://www.pytch.org/app/\">Pytch</a> which lets us move from programming with blocks (Scratch) to programming with code (Python).",
              "date": "2024-11-12",
              "tips": [
                "Here is another nice video about <a href=\"https://www.youtube.com/watch?app=desktop&v=Nsfuj8hFrVU\">Making a Game in Lua with No Experience</a> (Lua is the programming language used in Roblox)",
                "<a href=\"https://www.youtube.com/watch?v=C8YtdC8mxTU\">How Video Game Graphics Work</a>",
                "<a href=\"https://www.youtube.com/watch?v=F2AXJgsrs90\">How Game Boy Graphics Work</a>",
                "A basic Game Development App on the Nintendo Switch is called <a href=\"https://www.nintendo.com/us/store/products/game-builder-garage-switch/\">Game Builder Garage</a>. A more sophisticated Game Development App on the Nintendo Switch is called <a href=\"https://www.nintendo.com/us/store/products/fuze4-nintendo-switch-switch/\">Fuze4</a>.",
                "Some other good game development platforms are <a href=\"https://www.tynker.com/\">Tynker</a>, <a href=\"https://stencyl.com/\">Stencyl</a>, and <a href=\"https://www.bloxels.com/\">Bloxels</a>."
              ]
            },
            {
              "title": "Basics of App Development",
              "subTitle": "How You Can Build an App",
              "description": "We'll look at an <a href=\"https://appetize.io/demo\">online mobile app simulator</a>, learn how to simulate what a website will look like on a mobile device using our browser's dev tools (Ctrl + Shift + I), and more.",
              "date": "2024-11-19",
              "tips": []
            },
            {
              "title": "Review, Competitions & Group Activities",
              "subTitle": "We will review what we've learned, compete, and work in groups",
              "description": "We will review what we have learned so far in this module, you'll get a chance to show off any technology projects you've been working on at home, we will have some class competitions covering what we have learned, and then we'll split off into groups to work on some group activities.",
              "date": "2024-12-03",
              "tips": []
            }
          ]
        }
      ]
    },
    {
      "title": "Spring",
      "sections": [
        {
          "title": "Design & Animation",
          "classes": [
            {
              "title": "Basics of Animation",
              "subTitle": "Adding Motion to Our Work",
              "description": "We'll look at a video about <a href=\"https://www.youtube.com/watch?v=iOlehM5kNSk\">how CGI works</a>. We will also explore 3D characters and animations on <a href=\"https://www.mixamo.com/\">Mixamo</a>, <a href=\"https://sketchfab.com/\">Sketchfab</a>, and <a href=\"https://threejs.org/\">Three.js</a>. We will use the <a href=\"https://threejs.org/editor/\">Three.js Editor</a> to create our own 3D models and we'll also <a href=\"https://www.fab.com/category/3d-model?q=free\">download free 3D models from fab.com</a>.",
              "date": "2025-01-07",
              "tips": [
                "The <a href=\"https://threejs.org/manual/\">Three.js Manual</a> gives some great information about how to use the Three.js editor.",
                "Download 3D models at <a href=\"https://sketchfab.com/store\">Sketchfab</a>",
                "A basic <a href=\"https://youtu.be/DcDbRQUSbsw?t=157\">walkthrough video</a> on Youtube showing you how to create a simple house in the Three.js editor.",
                "Another great free 3D modeling software is <a href=\"https://www.blender.org/\">Blender</a>. <a href=\"https://playcanvas.com/\">PlayCanvas</a> is also another option."
              ]
            },
            {
              "title": "Basics of Design",
              "subTitle": "How to Make Tech Look Good",
              "description": "We'll look at one of the most popular tools in design today called <a href=\"https://www.figma.com/\">Figma</a>.",
              "date": "2025-01-14",
              "tips": []
            },
            {
              "title": "Review, Competitions & Group Activities",
              "subTitle": "We will review what we've learned, compete, and work in groups",
              "description": "We will review what we have learned so far in this module, you'll get a chance to show off any technology projects you've been working on at home, we will have some class competitions covering what we have learned, and then we'll split off into groups to work on some group activities.",
              "date": "2025-01-21",
              "tips": []
            }
          ]
        },
        {
          "title": "3D Printing",
          "classes": [
            {
              "title": "Basics of 3D Modeling",
              "subTitle": "Designing objects in 3D",
              "description": "We'll use <a href=\"https://www.tinkercad.com\">Tinkercad</a> to learn the basics of designing objects for 3D printing.",
              "date": "2025-01-28",
              "tips": [
                "<a href=\"https://www.autodesk.com/products/fusion-360/personal\">Fusion 360</a> is a downloadable, free, more powerful 3D design software used by a lot of 3D printers."
              ]
            },
            {
              "title": "Basics of 3D Printing",
              "subTitle": "How 3D Printing Works",
              "description": "We wil have a 3D printer in class to see how it works.",
              "date": "2025-02-04",
              "tips": []
            },
            {
              "title": "Review, Competitions & Group Activities",
              "subTitle": "We will review what we've learned, compete, and work in groups",
              "description": "We will review what we have learned so far in this module, you'll get a chance to show off any technology projects you've been working on at home, we will have some class competitions covering what we have learned, and then we'll split off into groups to work on some group activities.",
              "date": "2025-02-11",
              "tips": []
            }
          ]
        },
        {
          "title": "AR/VR & Robotics",
          "classes": [
            {
              "title": "Basics of AR/VR",
              "subTitle": "Learn about Augmented Reality (AR) and Virtual Reality (VR)",
              "description": "We'll explore the world of virtual reality.",
              "date": "2025-02-18",
              "tips": [
                "<a href=\"https://www.youtube.com/watch?v=i3DbJwy0R6E\">VR Development for Beginners 2024 - How to get started</a>",
                "<a href=\"https://experiments.withgoogle.com/collection/webvr\">Google's WebVR Experiments</a>"
              ]
            },
            {
              "title": "Basics of Robotics",
              "subTitle": "Learning about Robots",
              "description": "We'll use the <a href=\"https://rocksi.net\">Rocksi Robot Simulator</a> to learn how to control a robot. We'll also get some more in-depth experience programming a robot with <a href=\"https://vr.vex.com/?playground=Grid&lang=en\">VEXcode VR</a>.",
              "date": "2025-02-25",
              "tips": []
            },
            {
              "title": "Review, Competitions & Group Activities",
              "subTitle": "We will review what we've learned, compete, and work in groups",
              "description": "We will review what we have learned so far in this module, you'll get a chance to show off any technology projects you've been working on at home, we will have some class competitions covering what we have learned, and then we'll split off into groups to work on some group activities.",
              "date": "2025-03-04",
              "tips": []
            }
          ]
        },
        {
          "title": "Drones & Space Tech",
          "classes": [
            {
              "title": "Basics of Drones",
              "subTitle": "Learning About Drone Tech",
              "description": "We'll look at <a href=\"https://www.youtube.com/watch?v=N_XneaFmOmU\">how drones work</a>.",
              "date": "2025-03-18",
              "tips": []
            },
            {
              "title": "Basics of Space Tech",
              "subTitle": "Communicating with Computers in Space",
              "description": "We'll look at <a href=\"https://satellitetracker3d.com/\">a real time view of satellites in space</a>, view <a href=\"https://zoom.earth/maps/satellite/\">satellite weather images from space</a>, look at a <a href=\"https://www.youtube.com/watch?v=lx2CNP7kwhI\">live view from the International Space Station</a>, check out <a href=\"https://ciechanow.ski/gps/\">how GPS works</a>, and look at how our phone can connect to a satellite. We'll also look at <a href=\"https://www.youtube.com/watch?v=qs2QcycggWU\">how Starlink satellite internet service works</a>.",
              "date": "2025-03-25",
              "tips": [
                "<a href=\"https://youtube.com/watch?v=5voQfQOTem8\">How to Build a Satellite</a>",
                "<a href=\"https://starship-bysteve.netlify.app/\">Rocket Vertical Takeoff Simulator</a>",
                "<a href=\"https://iss-sim.spacex.com/\">SpaceX Docking Simulator</a>",
                "The GPS site mentioned above also has some nice tutorials exploring <a href=\"https://ciechanow.ski/internal-combustion-engine/\">car engines</a> and <a href=\"https://ciechanow.ski/mechanical-watch/\">mechanical watches</a>."
              ]
            },
            {
              "title": "Review, Competitions & Group Activities",
              "subTitle": "We will review what we've learned, compete, and work in groups",
              "description": "We will review what we have learned so far in this module, you'll get a chance to show off any technology projects you've been working on at home, we will have some class competitions covering what we have learned, and then we'll split off into groups to work on some group activities.",
              "date": "2025-04-01",
              "tips": []
            }
          ]
        },
        {
          "title": "Crypto & AI",
          "classes": [
            {
              "title": "Basics of Cryptocurrency",
              "subTitle": "Learning how BlockChain Works",
              "description": "We'll look at how BitCoin works.",
              "date": "2025-04-08",
              "tips": [
                "<a href=\"https://www.youtube.com/watch?v=SSo_EIwHSd4\">How does a blockchain work - Simply Explained</a>",
                "<a href=\"https://www.youtube.com/watch?v=bBC-nXj3Ng4\">But how does bitcoin actually work?</a>",
                "<a href=\"https://www.youtube.com/watch?v=_160oMzblY8\">Blockchain 101 - A Visual Demo</a> (<a href=\"https://www.youtube.com/watch?v=xIDL_akeras\">Part 2</a>)"
              ]
            },
            {
              "title": "Basics of AI",
              "subTitle": "Basics of artificial intelligence",
              "description": "We'll look back at the history of AI research by looking at the <a href=\"https://www.youtube.com/watch?v=cNxadbrN_aI\">perceptron from the 1950s</a> and then we'll look at a modern video showing <a href=\"https://www.youtube.com/watch?v=l-9ALe3U-Fg\">how a perceptron actually works</a>. We will then learn the fundamental concepts of artificial intelligence by looking at some videos that will help us <a href=\"https://www.youtube.com/playlist?list=PLZHQObOWTQDNU6R1_67000Dx_ZCJB-3pi\">visualize how neural networks work</a>.<br><br>We'll also explore <a href=\"https://teachablemachine.withgoogle.com/\">Google's Teachable Machine</a> and <a href=\"https://machinelearningforkids.co.uk/scratch/\">IBM's Machine Learning for Kids</a> (a good basic example is under 'Project Templates' by searching 'Hand gestures').<br><br>We'll look at some basic uses of AI including <a href=\"https://chatgpt.com/\">ChatGPT</a>, <a href=\"https://gemini.google.com\">Google Gemini</a> and <a href=\"https://claude.ai/\">Claude.AI</a>.<br><br>We'll look at 'text to image' using <a href=\"https://deepmind.google/technologies/imagen-3/\">Google's Imagen3</a>.<br><br>We'll also look at 'text to video' using <a href=\"https://openai.com/index/sora/\">Open AI's Sora</a>, <a href=\"https://runwayml.com/\">Runway ML</a>, and <a href=\"https://deepmind.google/technologies/veo/\">Google's Veo</a>.<br><br>In addition, we'll look at <a href=\"https://www.youtube.com/watch?v=HdT8G5S3IAc&ab_channel=TwoMinutePapers\">how AI can generate an entire 3D scene from a few photos</a>.",
              "date": "2025-04-15",
              "tips": [
                "<a href=\"https://www.maketecheasier.com/use-ai-develop-web-app/\">How I Used Claude.AI to Develop A Modern Web App</a>.",
                "Use AI to build and run a web app with <a href=\"https://gptengineer.app/\">GPT Engineer</a>",
                "<a href=\"https://www.tomsguide.com/ai/claude-artifacts-is-the-greatest-innovation-in-ai-this-year-5-prompts-to-try-it-now\">Building Game and Toy Websites with Claude.AI</a> (Tom's Hardware)"
              ]
            },
            {
              "title": "Review, Competitions & Group Activities",
              "subTitle": "We will review what we've learned, compete, and work in groups",
              "description": "We will review what we have learned so far in this module, you'll get a chance to show off any technology projects you've been working on at home, we will have some class competitions covering what we have learned, and then we'll split off into groups to work on some group activities.",
              "date": "2025-04-22",
              "tips": []
            }
          ]
        }
      ]
    }
  ]
}
